# Taps externos
tap "localstack/tap"
tap "JetBrains/utils"

# CLI tools
brew "git"
brew "starship"
brew "tmux"
brew "mise"
brew "volta"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "jq"
brew "curlie"
brew "tldr"
brew "awscli"
brew "opentofu"
brew "localstack/tap/localstack-cli"
brew "k9s"
brew "gnupg"
brew "pinentry-mac"
brew "JetBrains/utils/kotlin-lsp"
brew "1password-cli"

# Apps
cask "ghostty"
cask "zed"
cask "orbstack"
cask "1password"
cask "raycast"
cask "bruno"
cask "tableplus"
cask "dbngin"
cask "imageoptim"
cask "firefox-developer-edition"
cask "qflipper"
cask "sony-ps-remote-play"
cask "claude"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
